{"name":"Amara Graham","company":"Camunda","title":"Head of Developer Experience","image":{"url":"amara-graham.jpg"},"bio":"Amara is the Head of Developer Experience at Camunda. Before her step into developer relations, she was an enterprise web application developer focusing on line of business applications and assisting developers across various teams on implementing proprietary and open source solutions. She’s passionate about UX, technical communities (both online and offline) and excited to see where advances in AI take us. In her spare time, she experiments in the kitchen and plays video games.","twitter":"missamarakay","linkedin":"amara-graham","github":"akeller","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>\n\t\t\t  Developer Experience and Product-Led Growth (PLG) - how they enable each other and your\n\t\t\t  developer community, seamlessly.\n\t\t\t</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tDeveloper Experience has become a really hot topic recently, possibly due to less\n\t\t\ttraveling in DevRel but also with a shift to strategies like Product-Led Growth (PLG). We\n\t\t\tsee internally DX teams too - supporting internal tooling to increase productivity and\n\t\t\tefficiency around the organization or company.\n\t\t  </p>\n\t\t  <p>\n\t\t\tRather than seeing this shift as a hard company pivot, DX and PLG are really well suited\n\t\t\tto coexist and lead an organization - educating teams on identifying trends and patterns\n\t\t\tin community and customer feedback, turning that feedback into action, and measuring\n\t\t\tsuccess.\n\t\t  </p>\n\t\t  <p>\n\t\t\tWhile you don't have to formally do PLG at a company to see value in DX, understanding how\n\t\t\tto speak through PLG and DX will ultimately make the value of a DX team or program even\n\t\t\tgreater. I'll share my thoughts on what we are doing a Camunda, including DevRel and DX,\n\t\t\tand how we work together internally to support our external developer community with PLG.\n\t\t  </p>\n\t\t</div>\n\t  "}