{"name":"Josh Long","company":"VMware","title":"Spring Developer Advocate","image":{"url":"josh-long.jpeg"},"bio":"\n\t\t<div>\n\t\t  <a href=\"https://twitter.com/starbuxman\" target=\"_blank\">\n\t\t\tJosh (@starbuxman)\n\t\t  </a>\n\t\t  has been the first Spring Developer Advocate since 2010. Josh is a Java Champion, author of\n\t\t  6 books (including O'Reilly's \n\t\t  <a\n\t\t\thref=\"https://www.amazon.com/Cloud-Native-Java-Designing-Resilient/dp/1449374646\"\n\t\t\ttarget=\"_blank\"\n\t\t  >\n\t\t\t\"Cloud Native Java: Designing Resilient Systems with Spring Boot, Spring Cloud, and Cloud\n\t\t\tFoundry\"\n\t\t  </a>\n\t\t  and\n\t\t  <a href=\"https://reactivespring.io/\" target=\"_blank\">\n\t\t\t\"Reactive Spring\"\n\t\t  </a>\n\t\t  ) and numerous best-selling video training (including \n\t\t  <a\n\t\t\thref=\"https://www.oreilly.com/library/view/building-microservices-with/9780134192468/\"\n\t\t\ttarget=\"_blank\"\n\t\t  >\n\t\t\t\"Building Microservices with Spring Boot Livelessons\"\n\t\t  </a>\n\t\t  with Spring Boot co-founder Phil Webb), and an open-source contributor (Spring Boot, Spring\n\t\t  Integration, Spring Cloud, Activiti and Vaadin, etc), a podcaster (\"\n\t\t  <a href=\"https://bootifulpodcast.fm/\" target=\"_blank\">\n\t\t\tA Bootiful Podcast\n\t\t  </a>\n\t\t  \") and a YouTuber.\n\t\t</div>\n\t  ","twitter":"starbuxman","linkedin":"joshlong","github":"joshlong","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>Cloud Native Java</strong>\n\t\t  </p>\n\t\t  <p>“It is not necessary to change. Survival is not mandatory.” -W. Edwards Deming</p>\n\t\t  <p>\n\t\t\tWork takes time to flow through an organization and ultimately be deployed to production\n\t\t\twhere it captures value. It’s critical to reduce time-to-production. Software - for many\n\t\t\torganizations and industries - is a competitive advantage. Organizations break their\n\t\t\tlarger software ambitions into smaller, independently deployable, feature -centric batches\n\t\t\tof work - microservices. In order to reduce the round-trip between stations of work,\n\t\t\torganizations collapse or consolidate as much of them as possible and automate the rest;\n\t\t\tdevelopers and operations beget “devops,” cloud-based services and platforms automate\n\t\t\toperations work and break down the need for ITIL tickets and change management boards. But\n\t\t\tvelocity, for velocity’s sake, is dangerous. Microservices invite architectural complexity\n\t\t\tthat few are prepared to address. In this talk, we’ll look at how high performance\n\t\t\torganizations like Ticketmaster, Alibaba, and Netflix make short work of that complexity\n\t\t\twith Spring Boot and Spring Cloud.\n\t\t  </p>\n\t\t  <p>\n\t\t\tIn this talk, we'll look at how to build cloud-native Java systems that are elastic,\n\t\t\tagile, observable and robust.\n\t\t  </p>\n\t\t</div>\n\t  "}