{"name":"Natalie Pistunovich","company":"Aerospike","title":"Lead Developer Advocate","image":{"url":"natalie.png"},"bio":"Natalie is a learner, a Google Developer Expert for Go, an OpenAI Developer Ambassador, a public speaker and a sailor. When she's not working on robust systems at Aerospike, she is organizing the conferences: GopherCon Europe, Cloud Nein, HeyAI and BSides Berlin, and the Berlin chapters of the Go and Women Techmakers user groups. Previously, she was an Engineering Manager, Software and Hardware Engineer, and a Co-Founder of a mobile start-up. In her free time, she is wondering if there is life on Mars.","twitter":"NataliePis","linkedin":"nataliepistunovich","github":"Pisush","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>Building a K8s Operator for a Distributed Database</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tHow did we build a k8s operator that allows 100% up time for a high availability high\n\t\t\tworkload database? Operating a distributed high load, high throughput database in the\n\t\t\tcloud comes with several interesting challenges. In order to manage real-time serving of\n\t\t\tmission critical workloads at 100% availability we developed a Kubernetes operator that\n\t\t\thandles the operational complexities.\n\t\t  </p>\n\t\t  <p>We needed to handle the following requirements:</p>\n\t\t  <ul>\n\t\t\t<li>Apply live patches</li>\n\t\t\t<li>Replace live cluster with tens of nodes</li>\n\t\t\t<li>Handle degraded/crashed nodes</li>\n\t\t  </ul>\n\t\t  <p>Under these conditions:</p>\n\t\t  <ul>\n\t\t\t<li>High Availability</li>\n\t\t\t<li>remain 100% online with no down time</li>\n\t\t\t<li>Operate under very high workloads and traffic</li>\n\t\t\t<li>Manage replicated records across different hardware failure groups (rack awareness)</li>\n\t\t  </ul>\n\t\t  <p>Due to its stateful nature and the type of workloads that are usually handled, cluster management and recovery are non-trivial. We are using the Operators API to handle that complexity and control the clusters from within Kubernetes. In this talk we’ll cover the steps we took to plan and execute and the challenges we faced and share the best practices.</p>\n\t\t</div>\n\t  "}