[{"name":"Shawn Wang","title":"Head of DX","company":"Temporal","image":{"url":"swyx.jpg"},"bio":"swyx has worked on React and serverless JavaScript at Two Sigma, Netlify and AWS, and now serves as Head of Developer Experience at Temporal.io. He has started and run communities for hundreds of thousands of developers, like Svelte Society, /r/reactjs, and the React TypeScript Cheatsheet. His nontechnical writing was recently published in the Coding Career Handbook for Junior to Senior developers.","twitter":"swyx","linkedin":"shawnswyxwang","github":"sw-yx","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>The Radiating Circles of DevX</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tbuilding upon <a\n\t\t\t  href=\"https://podcasts.apple.com/us/podcast/the-radiating-circles-in-devx-with-swyx-head/id1599104169?i=1000551158483\"\n\t\t\t  target=\"_blank\"\n\t\t\t  rel=\"noopener noreferrer\"\n\t\t\t>\n\t\t\t  https://podcasts.apple.com/us/podcast/the-radiating-circles-in-devx-with-swyx-head/id1599104169?i=1000551158483\n\t\t\t</a>\n\t\t\t, this is the first time i'll ever do a talk giving the full mental model for building a\n\t\t\tcohesive developer experience from product to community!\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Zeno Rocha","title":"VP of Developer Experience","company":"WorkOS","image":{"url":"zeno-rocha.png"},"bio":"Zeno Rocha is a Brazilian creator and programmer. He currently lives in Los Angeles, California, where he's the VP of Developer Experience at WorkOS. His lifelong appreciation for building software and sharing knowledge led him to speak in over 110 conferences worldwide. His passion for open source put him on the top 20 most active users on GitHub at age 22. Before moving to the US, Zeno developed multiple applications, mentored startups, and worked at major companies in Latin America, such as Globo and Petrobras.","twitter":"zenorocha","linkedin":"zenorocha","github":"zenorocha","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>The Next Generation of Developer-First Products</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tIn this talk, we'll explore the different generations of developer-first products. We'll\n\t\t\texamine what's unique about them, and how you can prepare your product for the next\n\t\t\tgeneration.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Himanshu Mishra","title":"Developer Advocate","company":"Spotify","image":{"url":"himanshu-mishra.png"},"bio":"Himanshu is a Developer Advocate at Spotify working on backstage.io, previously an engineer and a core contributor to the project. He lives by \"Happy Developers write happy code\" and he loves advocating for Backstage and its impact on improving Developer Experience.","twitter":"OrkoHunter","linkedin":"OrkoHunter","github":"OrkoHunter","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>How Spotify engineers use Backstage daily and keep their lives simple</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tYou have a complex ecosystem of frameworks, technologies, and platforms. Each with their\n\t\t\town portal or tooling surrounding it. To remove friction, your autonomous teams all have\n\t\t\ttheir own implementation. Onboarding new developers is super confusing, and docs are\n\t\t\tscattered around the place. In short: chaos.\n\t\t  </p>\n\t\t  <p>\n\t\t\tThe solution to solving all this fragmentation might as well be.. another portal? Let's\n\t\t\ttake a look at Backstage [\n\t\t\t<a href=\"https://backstage.io\" target=\"_blank\" rel=\"noreferrer noopener\">\n\t\t\t  https://backstage.io\n\t\t\t</a>\n\t\t\t], an Open Source platform which you can use to build your own developer portal, is highly\n\t\t\tcustomisable and adopted by companies like Expedia, Netflix, American Airlines, and Epic\n\t\t\tGames. .\n\t\t  </p>\n\t\t  <p>\n\t\t\tSuzanne will share the story why Backstage was developed at Spotify, how it became the\n\t\t\tcore of their Developer Experience, and eventually a CNCF project. You’ll get a tour of\n\t\t\tthe Backstage platform, the plugin ecosystem, an understanding of the key use cases for\n\t\t\tBackstage and how Backstage might be a solution to control the chaos in your organisation.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Ramiro Berrelleza","company":"Okteto","title":"Founder and CEO","image":{"url":"ramiro-berrelleza.png"},"bio":"Ramiro Berrelleza is one of the founders of Okteto. He has spent most of his career (and his free time) building cloud services and developer tools. Before starting Okteto, Ramiro was an Architect at Atlassian and a Software Engineer at Microsoft Azure. Originally from Mexico, he currently lives in the Bay Area.","twitter":"rberrelleza","linkedin":"ramiroberrelleza","github":"rberrelleza","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\tOver the last five years, there has been a huge shift in the way applications get deployed\n\t\t\t- from self-hosted infrastructure to the world of cloud and Kubernetes clusters. This\n\t\t\tchange in deployment practices brought with it a lot of new things to the world developers\n\t\t\t- containers, cloud provider configurations, staging environments, to name a few. Instead\n\t\t\tof coding monoliths, we started to see a shift towards cloud-native applications\n\t\t\tconsisting of multiple microservices.\n\t\t  </p>\n\t\t  <p>\n\t\t\tSo while the way of application deployment has advanced, the workflows and tooling for\n\t\t\tdevelopment have remained stagnant. They didn't adapt completely or feel \"native\" to this\n\t\t\tworld of cloud-native applications. This led to an unpleasant developer experience\n\t\t\tinvolving a massive loss in developer productivity.\n\t\t  </p>\n\t\t  <p>\n\t\t\tThis talk is going to be about how cloud based remote development environments provide a\n\t\t\tsolution to this problem. A new development workflow solution that feels native to the\n\t\t\tmultiple microservices-based applications we see being developed these days. The talk will\n\t\t\tcover what these environments are, how they deliver a more pleasant developer experience,\n\t\t\tand how folks can get started using them with the help of open source tools like Okteto\n\t\t\tCLI.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Arsh Sharma","company":"Okteto","title":"Developer Experience Engineer","image":{"url":"arsh-sharma.jpeg"},"bio":"Arsh is a Developer Experience Engineer at Okteto. He is active in the open-source community and has contributed to multiple CNCF projects, including Kubernetes, cert-manager, and Kyverno. He received the Kubernetes Contributor Award for his contributions to the project last year. He loves simplifying technical concepts through his blogs and is also fond of sharing his experiences at conferences.","twitter":"rinkiyakedad","linkedin":"arsh4","github":"RinkiyaKeDad","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\tOver the last five years, there has been a huge shift in the way applications get deployed\n\t\t\t- from self-hosted infrastructure to the world of cloud and Kubernetes clusters. This\n\t\t\tchange in deployment practices brought with it a lot of new things to the world developers\n\t\t\t- containers, cloud provider configurations, staging environments, to name a few. Instead\n\t\t\tof coding monoliths, we started to see a shift towards cloud-native applications\n\t\t\tconsisting of multiple microservices.\n\t\t  </p>\n\t\t  <p>\n\t\t\tSo while the way of application deployment has advanced, the workflows and tooling for\n\t\t\tdevelopment have remained stagnant. They didn't adapt completely or feel \"native\" to this\n\t\t\tworld of cloud-native applications. This led to an unpleasant developer experience\n\t\t\tinvolving a massive loss in developer productivity.\n\t\t  </p>\n\t\t  <p>\n\t\t\tThis talk is going to be about how cloud based remote development environments provide a\n\t\t\tsolution to this problem. A new development workflow solution that feels native to the\n\t\t\tmultiple microservices-based applications we see being developed these days. The talk will\n\t\t\tcover what these environments are, how they deliver a more pleasant developer experience,\n\t\t\tand how folks can get started using them with the help of open source tools like Okteto\n\t\t\tCLI.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Ana Hevesi","title":"Devtools UX Researcher","image":{"url":"ana-hevesi.jpg"},"bio":"Ana Hevesi provides DX research services to inform DevRel and product strategy as an independent consultant. Previously, Ana shipped platform updates to ease tensions between Stack Overflow users, launched the first Node.js hosting platform, helped the Filecoin team prepare for outside contributors, and conducted user research at MongoDB. ","twitter":"anthrocypher","linkedin":"ananoemi","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>\"Peer Learning: Your developer adoption safety net\"</strong>\n\t\t  </p>\n\t\t  <div>\n\t\t\tWhen we try to get other developers to adopt our projects, we’re asking them to take on a\n\t\t\tnew learning curve. A large success factor is whether they have access to peer developers\n\t\t\twho can help them debug when they get stuck. This is the difference between developers\n\t\t\tassociating your tool with a growing sense of personal mastery, or the isolation,\n\t\t\tfrustration, and discouragement that leads them to put their efforts elsewhere. Together,\n\t\t\twe'll dive into why a peer learning network is the stickiness factor to your developer\n\t\t\texperience, anecdotes from successful peer learning communities, and how to lay the\n\t\t\tgroundwork for your own.\n\t\t  </div>\n\t\t</div>\n\t  "},{"name":"Amara Graham","company":"Camunda","title":"Head of Developer Experience","image":{"url":"amara-graham.jpg"},"bio":"Amara is the Head of Developer Experience at Camunda. Before her step into developer relations, she was an enterprise web application developer focusing on line of business applications and assisting developers across various teams on implementing proprietary and open source solutions. She’s passionate about UX, technical communities (both online and offline) and excited to see where advances in AI take us. In her spare time, she experiments in the kitchen and plays video games.","twitter":"missamarakay","linkedin":"amara-graham","github":"akeller","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>\n\t\t\t  Developer Experience and Product-Led Growth (PLG) - how they enable each other and your\n\t\t\t  developer community, seamlessly.\n\t\t\t</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tDeveloper Experience has become a really hot topic recently, possibly due to less\n\t\t\ttraveling in DevRel but also with a shift to strategies like Product-Led Growth (PLG). We\n\t\t\tsee internally DX teams too - supporting internal tooling to increase productivity and\n\t\t\tefficiency around the organization or company.\n\t\t  </p>\n\t\t  <p>\n\t\t\tRather than seeing this shift as a hard company pivot, DX and PLG are really well suited\n\t\t\tto coexist and lead an organization - educating teams on identifying trends and patterns\n\t\t\tin community and customer feedback, turning that feedback into action, and measuring\n\t\t\tsuccess.\n\t\t  </p>\n\t\t  <p>\n\t\t\tWhile you don't have to formally do PLG at a company to see value in DX, understanding how\n\t\t\tto speak through PLG and DX will ultimately make the value of a DX team or program even\n\t\t\tgreater. I'll share my thoughts on what we are doing a Camunda, including DevRel and DX,\n\t\t\tand how we work together internally to support our external developer community with PLG.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Layla Porter","company":"VMware","title":".NET Developer Advocate","image":{"url":"layla-porter.jpg"},"bio":"Layla is a Developer Advocate at VMware serving the .NET community. She is a Live Coder on Twitch, a Microsoft MVP, a GitHub Star, and the founder of the #WomenOfDotNet Initiative. Layla loves sharing knowledge whilst having fun. No question is stupid and beginners are always welcome.","twitter":"LaylaCodesIt","linkedin":"layla-porter","github":"Layla-p","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>TDD and the Terminator - An introduction to Test Driven Development</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tGetting started with Test Driven Development (TDD) can be very challenging. It requires a\n\t\t\tdifferent mindset and approach to writing and developing code. However, once in that\n\t\t\tmindset, it is very difficult not to write tests first.\n\t\t  </p>\n\t\t  <p>But why bother writing tests first?</p>\n\t\t  <p>\n\t\t\tIn this session, we will go through the reasons for writing tests before coding, look at\n\t\t\tarchitecture and design principles, such as SOLID and see how it all comes together to\n\t\t\tcreate a more testable and maintainable application.\n\t\t  </p>\n\t\t  <p>\n\t\t\tI will show you how to get started writing tests first with practical examples on how to\n\t\t\treprogram a T800 series Terminator so you can start using TDD in your own applications (or\n\t\t\tkiller robots from the future).\n\t\t  </p>\n\t\t  <p>Hasta La Vista badly-written code!</p>\n\t\t</div>\n\t  "},{"name":"Cirpo Cinelli","company":"","title":"DevX Engineering Manager","image":{"url":"alessandro-cinelli.jpeg"},"bio":"\n\t\t<div>\n\t\t  <p>\n\t\t\tAlessandro Cinelli (a.k.a. cirpo), Engineering Manager in London, loves building and\n\t\t\tsupporting high-performing engineering teams while delivering valuable products that solve\n\t\t\ttangible needs. His focus for the past 4 years has been on internal developer experience,\n\t\t\timproving all the things around the software development cycle for all the people in\n\t\t\tengineering.\n\t\t  </p>\n\t\t  <p>He is passionate about Lego, music, devx, communities, management, and people.</p>\n\t\t</div>\n\t  ","twitter":"cirpo","linkedin":"cirpo","github":"cirpo","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>Building a DevX team, my story</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tDevX has been an emerging concept for the past two years, and while we are still trying to\n\t\t\tgive it a shared and structured definition in the tech industry, some common questions are\n\t\t\talready arising, and the most compelling one is: where to start with developer experience?\n\t\t\tIn this presentation, I will talk about my past 4 years of experience setting up a DevX\n\t\t\tteam from scratch, the main challenges, the pain, the gain, and the lessons learned.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Brendan Falk","company":"Fig","title":"Co-founder & CEO","image":{"url":"brendan-falk.png"},"bio":"Brendan is co-founder/CEO of Fig. Fig makes the terminal easier for beginners, more productive for advanced engineers, and more collaborative for teams. Fig is backed by YC, General Catalyst, and founders/executives from Stripe, Heroku, Adobe, and GitHub. Brendan graduated from Harvard College in 2020 is originally from Australia.","twitter":"brendanfalk","linkedin":"brendanfalk","github":"brendanfalk","abstract":"How Fig makes engineers 10x more productive in the terminal."},{"name":"Victor Savkin","title":"Co-founder","company":"Nrwl","image":{"url":"victor-savkin.jpeg"},"bio":"Nrwl co-founder, ex-Googler, ex-Angular core. Work on dev tools for TS/JS. Nx and Nx Cloud creator.","twitter":"victorsavkin","linkedin":"victorsavkin","github":"vsavkin","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>The balancing act of delivering high quality DX</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tDesigning a general-purpose build system involves making a lot of trade-offs: tool-ability\n\t\t\tvs. expressiveness, efficiency vs. ease of learning, lean configuration vs.\n\t\t\tdiscoverability, extensibility vs. API surface. These are in a constant conflict, making\n\t\t\tit a balancing act of driving coherence while ensuring high-quality DX. Such undertaking\n\t\t\tcan be challenging unless you have an explicit set of design principles to help guide you.\n\t\t  </p>\n\t\t  <p>\n\t\t\tIn this talk, I'll show what such principles look like on the example of Nx, an extensible\n\t\t\tbuild system I've been leading for the past 5 years.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Zach Lloyd","title":"Founder & CEO","company":"Warp","image":{"url":"zach-lloyd.png"},"bio":"\n\t\t<p>\n\t\t  Zach is currently the CEO and founder of Warp, which is reinventing the terminal, making it\n\t\t  10x more usable for developers and teams. Prior to Warp, he was the interim CTO at TIME,\n\t\t  co-founder and CTO of SelfMade, and a Principal Engineer at Google leading development on\n\t\t  Google Docs, Sheets, and Slides. Zach aims to create software that has a positive impact on\n\t\t  a lot of people. He also loves playing guitar and hanging with his pup Blue.\n\t\t</p>\n\t  ","twitter":"zachlloydtweets","linkedin":"zachlloyd","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>Warp and the future of the terminal</strong>\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Lydia Hallie","title":"Staff Developer Advocate","company":"Vercel","image":{"url":"lydia-hallie.jpeg"},"bio":"Lydia Hallie is a Staff Developer Advocate at Vercel who primarily focuses on JavaScript, React, Node, serverless technologies, and web performance. She also spends her time mentoring and doing in-person training sessions.","twitter":"lydiahallie","linkedin":"lydia-hallie","github":"lydiahallie","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\tAs modern applications are getting more and more complex, it's quite easy to end up with\n\t\t\tlarge bundle sizes and long loading times. Although there are many tools that can help\n\t\t\twith performance, there's still a lot you can do as a developer to load your code more\n\t\t\tefficiently. Fortunately, with the help of modern rendering patterns, we can reduce\n\t\t\tcomplexity, bundle sizes, and reduce loading times. In this talk, you'll learn about the\n\t\t\timplementation and use cases of modern rendering patterns including SSR, (on-demand) ISR,\n\t\t\tStreaming SSR, React Server Components, Progressive Rehydration, and Selective\n\t\t\tRehydration.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Inian Parameshwaran","company":"Supabase","title":"Senior Software Engineer","image":{"url":"inian.jpeg"},"bio":"Inian Parameshwaran is a Senior Software Engineer at Supabase, an open-source Firebase alternative. He likes chocolates, working on developer tools and is passionate about security and performance. Previously, he founded a venture backed startup which helps speed up websites automatically. Did I mention he likes chocolates?","twitter":"everconfusedguy","linkedin":"inianp","github":"inian","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t  Supabase launched Edge Functions recently. This talk is a peek behind the curtains about how Supabase approaches Developer Experience. A lot of decisions went into ensuring that authoring and deploying functions on Supabase is as seamless as possible and I go over some of the tradeoffs we took. \n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Tarun Pothulapati","title":"Engineer","company":"Gitpod","image":{"url":"tarun-pothulapati.jpg"},"bio":"Tarun Pothulapati is an Engineer at Gitpod working on democratising cloud developer environments. Previously, He was a maintainer of Linkerd, an open source, CNCF Incubated Service Mesh project. He also spends his time contributing to other OSS projects like Tracing, etc. Apart from work, He’s trying to be a marathon runner, and is a big coffee enthusiast.","twitter":"tarrooon","linkedin":"tpothulapati","github":"pothulapati","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>Remote development in a remote-first world</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tIs your development environment a pet? Convert that pet into cattle by going remote! Our\n\t\t\tdevelopment environments continue to become more and more complex to set up. Each project\n\t\t\twe work on has a unique set of dependencies and keeping everything up to date can be a\n\t\t\tfull time job. With Kubernetes, we made the transition from services operating on pet-like\n\t\t\tinfrastructure to cattle. By packaging dependencies and spinning up on-the-fly\n\t\t\tenvironments, we can make the same transition for development environments.\n\t\t  </p>\n\t\t  <p>\n\t\t\tIn this talk, you will learn where remote development environments have been, where they\n\t\t\tare today and where they’re going in the future. We will discuss why right now is a\n\t\t\tperfect time to adopt this new style of development and provide a clear path to adopting\n\t\t\tthe best practices required to convert your pet-like development environment into cattle.\n\t\t  </p>\n\t\t  <p>The following points will be covered in depth:</p>\n\t\t  <ul>\n\t\t\t<li>Problem space that remote development environments solve, and it’s approach.</li>\n\t\t\t<li>How VS Code Remote IDE, JetBrains Fleet, etc work.</li>\n\t\t\t<li>Code from Anywhere, Any Device (due to Browser support)</li>\n\t\t\t<li>On-Demand, Development environments</li>\n\t\t\t<li>\n\t\t\t  Standardisation of developer environments with formats like devContainer.json,\n\t\t\t  gitpod.yml, etc to provide project specific environments.\n\t\t\t</li>\n\t\t\t<li>\n\t\t\t  How this model goes very well with OSS development where you want folks to spend as less\n\t\t\t  time on the configuration of dev environment\n\t\t\t</li>\n\t\t  </ul>\n\t\t  <p>\n\t\t\tBy the end of this talk, Audiences will leave with the past, present and future of Remote\n\t\t\tDeveloper Environments, and have an understanding of how they can make use of it in their\n\t\t\texisting projects and companies. Instead of focusing on the specific implementation, tools\n\t\t\ton how it's done, we focus on the concepts itself so that the audience are free to choose\n\t\t\twhatever implementations that they are comfortable with.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Oleg Šelajev","title":"Developer Advocate","company":"AtomicJar","image":{"url":"oleg-selajev.jpg"},"bio":"Oleg Šelajev is a developer advocate at AtomicJar working integration tests with Testcontainers better for everyone in the community. VirtualJUG leader. In 2017 became a Java Champion.","twitter":"shelajev","linkedin":"shelajev","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>How to make a world-class integration testing library?</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tExcellent developer experience is a careful balance between boredom and anxiety. Ideally,\n\t\t\tit would make solving simple problems trivial, complex ones simple, and have enough\n\t\t\tflexibility to inspire hope for tackling the impossible ones!\n\t\t  </p>\n\t\t  <p>\n\t\t\tIn this session, we’d like to share the story of Testcontainers - the world’s most popular\n\t\t\tintegration testing libraries. And look at the developer experience choices that led\n\t\t\tlibraries aimed at a tedious and often ungrateful task of environment setup and\n\t\t\tintegration testing to bring joy and even influence how developers approach their projects\n\t\t\taltogether.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Alayshia Knighten","title":"Manager, Onboarding Engineering","company":"Honeycomb","image":{"url":"alayshia-knighten.jpg"},"bio":"Alayshia is an Onboarding Engineering manager at Honeycomb who specializes in Observability and Production Excellence. She is also a modern-day hippie that simply enjoys getting \"ish\" done while \"buzzing\" around with customers, transforming their DevOps world.","linkedin":"alayshia","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>Progressive Delivery with Observability</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tBuild, test, and deploy can be a bloody nightmare. So we try in non-production\n\t\t\tenvironments and hold our breath, hoping that everything is okay when we push our\n\t\t\tdeployments to production. When it's not okay, we waste time mimicking a fake production\n\t\t\tenvironment. What if I told you we had a way to monitor our production systems based on\n\t\t\tthe data we receive from them?**cough** Observability *cough*\n\t\t  </p>\n\t\t  <p>\n\t\t\tLet's ask questions about our production systems, allow the data to report back, and\n\t\t\tanswer the question, \"is it safe to continue?\" Using data-driven decisions in our CI/CD\n\t\t\tworkflows lets us breathe easy \"knowing\" what's in front of us.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Boris Kirov","title":"Senior Product Designer","company":"Elastic","image":{"url":"boris-kirov.jpg"},"bio":"Boris is a Bulgarian product designer, currently based in Amsterdam, The Netherlands. His interest in form and function lets him express himself with technology. Fascinated by computers, he is constantly experimenting with software to understand how programs communicate between each other and how we communicate with them. His passion for open source, collaboration and developer experience led him to Elastic, while previously he used to design the Platform experience at Miro.","twitter":"sboriskirov","github":"boriskirov","linkedin":"boris-kirov-b6b110a4","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>\"Designing for developers\"</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tIn this talk we will go on a journey of understanding what designing for developers is,\n\t\t\tand how important it is to gain empathy and connect with your audience. We will go through\n\t\t\tconcepts and methods for designing great developer experience, by covering the\n\t\t\tfundamentals of computer programming, web development and design thinking process. This\n\t\t\ttalk will allow designers, managers and people outside of the engineering group to\n\t\t\tdeep-dive in what it means to experience the development and usage of software.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Maya Kaczorowski","title":"Product Manager","company":"Tailscale","image":{"url":"maya-kaczorowski.jpg"},"bio":"Maya is a Product Manager at Tailscale, providing secure networking for the long tail. She was previously at GitHub in software supply chain security, and before that at Google working on container security and encryption key management. Prior to Google, Maya worked at McKinsey, and studied mathematics.","twitter":"MayaKaczorowski","linkedin":"mayakaczorowski","github":"mayakacz","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t  \tAlthough many development teams have now adapted to working remotely, far fewer are developing remotely. We all know the benefits of remote work - freedom and flexibility to work where and when you want - but we don’t often talk about the downsides, specifically thte isolation that comes from working alone.\n\t\t  </p>\n\t\t  <p>\n\t\t  \tIn this talk, we’ll discuss a few ways that developing remotely can actually help address some of the hurdles your team might face working remotely. Tools on their own can’t fix organizational challenges, but paired with the right operations, your team can get the best of both worlds, with better developer onboarding, developer velocity, and simpler, more secure access to shared resources. \n\t\t  </p>\n\t\t  <p>\n\t\t\tSo, if you’ve already had success working remotely, maybe it’s time to try developing remotely. \n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Michael Bleigh","title":" Staff Software Engineer","company":"Google","image":{"url":"michael-bleigh.jpg"},"bio":"Michael is an engineering leader at Firebase and has been building stuff to make developers' lives easier for more than a decade. Michael's experience across open source (creator of Ruby libraries such as omniauth and grape), startups (founder of Divshot), and scaled platforms (Firebase) gives him a great deal of empathy for developers and the challenges they face. Michael has also spoken at events including Railsconf, Rubyconf, OSCON, and Google I/O.","twitter":"mbleigh","linkedin":"mbleigh","github":"mbleigh","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t  \t<strong>What does it mean to create API products at scale? How do you do it well and keep the wheels from coming off?</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t  \tFirebase is a massive developer platform with 15+ products offered across 6+ platforms. Firebase is also known for a high-quality consistent developer experience. In this talk, peek behind the scenes at how Firebase keeps the quality bar high for its APIs while continuously evolving and growing its products. Learn how boring words like \"process\" and \"governance\" can play a pivotal and even enjoyable role in the building of complex developer systems.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Nathan Sobo","title":"Programmer / Entrepreneur","company":"Zed","image":{"url":"nathan-sobo.jpeg"},"bio":"\n\t\t\t<div>\n\t\t\t<p>\n\t\t\t\tNathan joined GitHub in late 2011 to build the Atom text editor, and he led the Atom team until 2018.\n\t\t\t</p>\n\n\t\t\t<p>\n\t\t\t\tHe also co-led development of Teletype for Atom, pioneering one of the first production uses of conflict-free replicated data types for collaborative text editing.\n\t\t\t</p>\n\t\t\t\n\t\t\t<p>\n\t\t\t\tHe's been dreaming about building the world’s best text editor since he graduated from college, and is excited to finally have the knowledge, tools, and resources to achieve this vision. \n\t\t\t</p>\n\t\t\t</div>\n\t\t","twitter":"nathansobo","github":"nathansobo","abstract":"\n\t\t<div>\n\t\t\t<p>Zed: Collaborative coding at the speed of light</p>\n\t\t\t<p>\n\t\t\t\t<a href=\"https://zed.dev\" >Zed</a> is a fast, collaborative code editor created by the same team that brought you GitHub's Atom editor, and we're preparing to launch a private alpha in the coming weeks. In this talk, I l will demo Zed publicly for the first time and explore its unique features as well as interesting aspects of its implementation. This includes our use of conflict-free replicated data types, our custom hardware-accelerated UI framework, and the unique testing strategies we've devised to make collaborative code editing \"just work\".\n\t\t\t</p>\n\t\t</div>\n\t  "},{"name":"Kirill Skrygan","title":"Department Lead","company":"Intellij","image":{"url":"kirill-skrygan.jpg"},"bio":"Intellij Department lead","twitter":"kskrygan","github":"kskrygan","linkedin":"kirill-skrygan-7b86073a","abstract":"\n\t\t<p>\n\t\t\tPanel talk on remote development.\n\t\t</p>\n\t  "},{"name":"Nik Molnar","title":" Product Director on Codespaces","company":"GitHub","image":{"url":"nik-molnar.jpg"},"bio":"Nik Molnar is the Director of Product on Codespaces at GitHub. He is a father, daddy, baseball player, board gamer, Pluralsight author, lover of the web, and home chef.","twitter":"nikmd23","github":"nikmd23","linkedin":"nikmd23","abstract":"\n\t\t<p>\n\t\t\tPanel talk on remote development.\n\t\t</p>\n\t  "},{"name":"Johannes Landgraf","title":"Co-founder & Co-CEO","company":"Gitpod","image":{"url":"johannes.jpeg"},"bio":"Co-CEO & Co-Founder Gitpod","twitter":"johannneslandgraf","github":"johannneslandgraf","abstract":"\n\t\t<p>\n\t\tPanel talk on remote development.\n\t\t</p>\n\t  "},{"name":"Sven Efftinge","title":"Co-founder & Co-CEO","company":"Gitpod","image":{"url":"sven-efftinge.jpeg"},"bio":"Sven is a Co-founder and Co-CEO of Gitpod. Before Gitpod he built and designed other development tools and programming languages. In his spare time he enjoys living at and kitesurfing on the baltic sea.","twitter":"svenefftinge","github":"svenefftinge","abstract":"\n\t\t<p>\n\t\tPanel talk on remote development.\n\t\t</p>\n\t  "},{"name":"Christof Marti","title":"Principal Software Engineer","company":"Microsoft","image":{"url":"christof-marti.jpeg"},"bio":"Christof is the lead software engineer on the dev container project and a member of the VS Code team at Microsoft.","abstract":"\n\t\t<p>\n\t\tPanel talk on remote development.\n\t\t</p>\n\t  "},{"name":"Chad Metcalf","title":"Building a Self Hosted Business","company":"Gitpod","image":{"url":"chad-metcalf.jpg"},"bio":"Currently helping to build Gitpod. Docker, Cloudera, Puppet, WibiData alumni. Advising startups. Angel investor.","twitter":"metcalfc","github":"metcalfc","abstract":"\n\t\t<p>\n\t\tPanel talk on a history and how Docker thought about DevX.\n\t\t</p>\n\t  "},{"name":"Ben Firshman","title":"Founder","company":"Replicate","image":{"url":"ben-firshman.jpg"},"bio":"Founder of Replicate. Previously, he was product at Docker and was one of the creators of Docker Compose. He also founded a few companies, written things like https://clig.dev/ , helped create The Guardian’s iPad app, and worked on GOV.UK.","twitter":"bfirsh","abstract":"\n\t\t<p>\n\t\tPanel talk on a history and how Docker thought about DevX.\n\t\t</p>\n\t  "},{"name":"Arnaud Porterie","title":"Founder","company":"Echoes HQ","image":{"url":"arnaud-porterie.jpg"},"bio":"Arnaud Porterie is the founder of Echoes HQ, a product helping hundreds of engineering organizations maximize their impact.\n\n\t\tAt Docker, Arnaud has managed one of the most active open source communities with over a 400 weekly contributors. Running a project at this scale has taught him both the importance of data for decision making and the importance of developer experience.\n\t\t\n\t\tAt Veepee, Arnaud has scaled a team of 350 to a European-wide organization of 900. He realized there how unequipped were engineering leaders to make data informed decisions and effectively communicate on their teams' activity in a way that their business partners and bosses could understand.","twitter":"arnaudporterie","abstract":"\n\t\t<p>\n\t\tPanel talk on a history and how Docker thought about DevX.\n\t\t</p>\n\t  "},{"name":"Andrea Luzzardi","title":"Co-Founder","company":"Dagger","image":{"url":"andrea-luzzardi.png"},"bio":"Co-Founder at Dagger. Previously engineering at Docker, Google & Microsoft.","twitter":"aluzzardi","abstract":"\n\t\t<p>\n\t\tPanel talk on a history and how Docker thought about DevX.\n\t\t</p>\n\t  \t"},{"name":"Shanea Leven","title":"Co-founder & CEO","company":"CodeSee","image":{"url":"shanea-leven.jpeg"},"bio":"Shanea Leven is co-founder and CEO of CodeSee, a code understanding platform helping developers and teams onboard to codebases, improve code review, code planning, and more. Prior to CodeSee, Shanea led dev-focused product teams at Cloudflare, Docker, eBay and Google. Follow Shanea on Twitter @ShaneaLeven and CodeSee @CodeSeeio.","twitter":"shanealeven","abstract":"\n\t\t<p>\n\t\tCode Reviews is more than a crushing Developer Experience, its really a deeply human experience.\n\t\t</p>\n\t  "},{"name":"Wilson Mar","title":"Senior Domain Architect","company":"Hashicorp","image":{"url":"wilson-mar.jpeg"},"bio":"After surviving dozens of botched onboardings as both employee and consultant, Wilson Mar has championed better processes, earlier for fellow developers and others at enterprise software organizations.","github":"wilsonmar","linkedin":"wilsonmar","abstract":"\n\t\t<p>\n\t\tHow to onboard people in a day. Companies that drag out onboarding drain the goodwill of new people. Here are dozens of specific, concrete actions to ensure instant productivity from joiners.\n\t\t</p>\n\t  "}]