[{"name":"Jason Warner","company":"GitHub","title":"CTO","image":{"url":"jason-warner.jpeg"},"bio":"Jason Warner is GitHub’s Chief Technology Officer. In his role, Jason oversees the Office of the CTO, whose mission is to explore the unknown and non-existent aspects of technology and software in order to build a map of GitHub’s future. Jason was previously Senior Vice President of Technology at GitHub, where he has played an integral role in scaling the Engineering, Product, and Security Teams, and building GitHub’s product roadmap to fit the needs of developers around the world.Prior to joining GitHub in 2017, Jason was Vice President of Engineering at Heroku. Before Heroku, Jason oversaw Product Engineering for Ubuntu Desktop and Ubuntu Phone at Canonical. Jason is passionate about building technologies that bring people together, and he’s an active speaker, writer, and advisor.","twitter":"jasoncwarner","linkedin":"jcwarner","github":"jasoncwarner","abstract":"DevX at Heroku and GitHub - An interview with Jason Warner"},{"name":"Erich Gamma","company":"Microsoft","title":"VS Code Dev Lead","image":{"url":"erich-gamma.jpg"},"bio":"\n\t\t  <p>\n\t\t\tErich is a Microsoft Technical Fellow and is currently working on Visual Studio Code. In\n\t\t\tthe past he contributed to Design Patterns, JUnit, Eclipse, and IBM’s Rational Team\n\t\t\tConcert. He works in Zurich and skis in Andermatt, Switzerland.\n\t\t  </p>\n\t  ","twitter":"ErichGamma","linkedin":"erichgamma","github":"egamma","abstract":"The evolution of DevX - An interview with Erich Gamma"},{"name":"Henry Zhu","company":"Babel","title":"Core Maintainer","image":{"url":"henry-zhu.jpeg"},"bio":"Henry works in open source as a steward of Babel after leaving a job at Adobe. He wants to understand the future of open source through maintenance, funding efforts, and conversations via Hope in Source podcast.","twitter":"left_pad","linkedin":"","github":"hzoo","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>Trapped in the Open Source Supply Chain</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tLet us talk about the perspective of open source projects as dependencies. As someone in\n\t\t\tthe middle of it, I just wanted to share some thoughts on taking what is considered\n\t\t\tlargely a hobby and going the donation route. What are maintainers free to work on, what\n\t\t\tis the lifecycle of a project, what is worth funding anyway?\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Jean Yang","company":"Akita Software","title":"Founder and CEO","image":{"url":"jean-yang.jpeg"},"bio":"\n\t\t  <p>\n\t\t\tJean Yang (\n\t\t\t<a href=\"https://twitter.com/jeanqasaur\" target=\"_blank\">\n\t\t\t  @jeanqasaur\n\t\t\t</a>\n\t\t\t) is the founder and CEO of <a href=\"https://www.akitasoftware.com/\" target=\"_blank\">\n\t\t\t  Akita Software\n\t\t\t</a>\n\t\t\t, a developer tools company that is bringing structure to observability. Previously, Jean\n\t\t\twas a professor of Computer Science at Carnegie Mellon University. Jean has a PhD from\n\t\t\tMIT, holds software tools patents from work at Microsoft Research and Facebook, and was\n\t\t\tselected as one of the MIT Technology Review's 35 Innovators Under 35 in 2016.\n\t\t  </p>\n\t\t","twitter":"jeanqasaur","linkedin":"jean-yang-96575030","github":"jeanqasaur","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>\"Testing\" in Prod Isn't the Only Way: Why Observability Needs Structure</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tThe rise of APIs and service-oriented architectures has made it easier than ever before to\n\t\t\tbuild complex web applications. But the developer tools we use were made for a simpler\n\t\t\ttime, one where developers had more control over all of the software they ran. Today, web\n\t\t\tapplications contain many heterogeneous components, all talking to each other across the\n\t\t\tnetwork, many of them SaaS apps. \"Testing\" in production has become the only way to make\n\t\t\tsense. I'll talk about why we need to update our idea of testing, how we can do better at\n\t\t\tunderstanding prod, and how bringing structure to observability is the way forward for\n\t\t\tboth.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Rachel Myers","company":"Google","title":"Engineer","image":{"url":"rachel-myers.jpg"},"bio":"Rachel's an engineer on Firebase Authentication and Security Rules; she focuses on empowering developers to build secure, best-in-class applications that robustly protect users’ privacy. Before joining Google, Rachel co-founded Opsolutely (YC S16), and was an early engineer at GitHub. Outside of work, she mentors and invests in founders from underrepresented backgrounds, serves on the Board for RailsBridge, and has received awards from Women Who Code. She/Her.","twitter":"rachelmyers","linkedin":"rachelmyers","github":"rachelmyers","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>Streamlining Firebase Development with local Emulators</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tPeople love Firebase for making every read or write just an API call away. What they\n\t\t\tdidn’t love was that, for years, the only development environment where you could reliably\n\t\t\ttest changes was a duplicate Firebase project. It was expensive, prone to mishaps, and\n\t\t\trequired an internet connection at all times. This is the story of building local\n\t\t\temulators that let a developer set up a new Firebase dev environment in about a minute,\n\t\t\tand the mistakes we made along the way.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Ellen Chisa","company":"Darklang","title":"Founder","image":{"url":"ellen-chisa.jpeg"},"bio":"\n\t\t<p>\n\t\t  Ellen Chisa is founder-in-residence at Boldstart, a first check VC for technical founders.\n\t\t  Previously, she cofounded Dark (\n\t\t  <a href=\"https://darklang.com\" target=\"_blank\">\n\t\t\thttps://darklang.com\n\t\t  </a>\n\t\t  ), a programming language tightly integrated to its editor and infrastructure.\n\t\t</p>\n\t  ","twitter":"ellenchisa","linkedin":"ellenchisa","github":"ellenchisa","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>Is DevEx not good… because we don't want it to be?</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tEvery developer claims they want something that just works, so they can just get back to\n\t\t\twriting code. But… we love being the latest to use a new tool, take joy in debugging\n\t\t\tproblems no one else can solve, and want to know how things work under the hood. Every\n\t\t\ttool claims to make our lives faster and easier, but what do we really want out of our\n\t\t\tdeveloper experience? Maybe we do want it to be hard - just not too hard.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Josh Long","company":"VMware","title":"Spring Developer Advocate","image":{"url":"josh-long.jpeg"},"bio":"\n\t\t<div>\n\t\t  <a href=\"https://twitter.com/starbuxman\" target=\"_blank\">\n\t\t\tJosh (@starbuxman)\n\t\t  </a>\n\t\t  has been the first Spring Developer Advocate since 2010. Josh is a Java Champion, author of\n\t\t  6 books (including O'Reilly's \n\t\t  <a\n\t\t\thref=\"https://www.amazon.com/Cloud-Native-Java-Designing-Resilient/dp/1449374646\"\n\t\t\ttarget=\"_blank\"\n\t\t  >\n\t\t\t\"Cloud Native Java: Designing Resilient Systems with Spring Boot, Spring Cloud, and Cloud\n\t\t\tFoundry\"\n\t\t  </a>\n\t\t  and\n\t\t  <a href=\"https://reactivespring.io/\" target=\"_blank\">\n\t\t\t\"Reactive Spring\"\n\t\t  </a>\n\t\t  ) and numerous best-selling video training (including \n\t\t  <a\n\t\t\thref=\"https://www.oreilly.com/library/view/building-microservices-with/9780134192468/\"\n\t\t\ttarget=\"_blank\"\n\t\t  >\n\t\t\t\"Building Microservices with Spring Boot Livelessons\"\n\t\t  </a>\n\t\t  with Spring Boot co-founder Phil Webb), and an open-source contributor (Spring Boot, Spring\n\t\t  Integration, Spring Cloud, Activiti and Vaadin, etc), a podcaster (\"\n\t\t  <a href=\"https://bootifulpodcast.fm/\" target=\"_blank\">\n\t\t\tA Bootiful Podcast\n\t\t  </a>\n\t\t  \") and a YouTuber.\n\t\t</div>\n\t  ","twitter":"starbuxman","linkedin":"joshlong","github":"joshlong","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>Cloud Native Java</strong>\n\t\t  </p>\n\t\t  <p>“It is not necessary to change. Survival is not mandatory.” -W. Edwards Deming</p>\n\t\t  <p>\n\t\t\tWork takes time to flow through an organization and ultimately be deployed to production\n\t\t\twhere it captures value. It’s critical to reduce time-to-production. Software - for many\n\t\t\torganizations and industries - is a competitive advantage. Organizations break their\n\t\t\tlarger software ambitions into smaller, independently deployable, feature -centric batches\n\t\t\tof work - microservices. In order to reduce the round-trip between stations of work,\n\t\t\torganizations collapse or consolidate as much of them as possible and automate the rest;\n\t\t\tdevelopers and operations beget “devops,” cloud-based services and platforms automate\n\t\t\toperations work and break down the need for ITIL tickets and change management boards. But\n\t\t\tvelocity, for velocity’s sake, is dangerous. Microservices invite architectural complexity\n\t\t\tthat few are prepared to address. In this talk, we’ll look at how high performance\n\t\t\torganizations like Ticketmaster, Alibaba, and Netflix make short work of that complexity\n\t\t\twith Spring Boot and Spring Cloud.\n\t\t  </p>\n\t\t  <p>\n\t\t\tIn this talk, we'll look at how to build cloud-native Java systems that are elastic,\n\t\t\tagile, observable and robust.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Shanea Leven","company":"CodeSee","title":"Founder & CEO","image":{"url":"shanea-leven.jpeg"},"bio":"\n\t\t<p>\n\t\t  Shanea is the co-founder and CEO of a developer platform called \n\t\t  <a href=\"https://www.codesee.io/\" target=\"_blank\">\n\t\t\tCodeSee.io\n\t\t  </a>\n\t\t  . CodeSee shows you how your code works. CodeSee helps developers to deeply understand how\n\t\t  your large-scale codebase works, document it, and collaborate continuously. Shanea has spent\n\t\t  many years as a product leader building platforms for developers at Google, Docker, eBay,\n\t\t  Cloudflare and most recently she was VP of product at Lob. She studied Computer Science and\n\t\t  Business.\n\t\t</p>\n\t  ","twitter":"shanealeven","linkedin":"shaneak","github":"","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>Internal DevX Experience is broken… and you should be pissed</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tOur day to day developer experience is filled with practices that are inefficient, panic\n\t\t\tridden and just down-right an utter slog. Let's talk about how we can create a more\n\t\t\tdelightful daily experience by shifting our perspective from just in time understanding to\n\t\t\tcontinuous code understanding.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Beyang Liu","company":"Sourcegraph","title":"CTO","image":{"url":"beyang-liu.jpeg"},"bio":"Beyang Liu is CTO and cofounder of Sourcegraph. Prior to Sourcegraph, Beyang was a software engineer at Palantir Technologies, where he developed new data analysis software on a small, customer-facing team working with Fortune 500 companies. Beyang studied Computer Science at Stanford, where he published research in probabilistic graphical models and computer vision at the Stanford AI Lab and thoroughly enjoyed his compilers course.","twitter":"beyang","linkedin":"beyang-liu","github":"beyang","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>DevX: History of Code Search</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tWhat is code search? Code search is an important dev tool for some of the largest and most\n\t\t\thighly respected companies and open-source organizations, but many developers have never\n\t\t\tused it before. We'll go over the history and evolution of code search, why it's becoming\n\t\t\tmore popular now, and how it might help you and your collaborators become a better team of\n\t\t\tsoftware engineers.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Maël Nison","company":"Yarn","title":"Lead Maintainer","image":{"url":"mael-nison.jpeg"},"bio":"Maël has worked with code repositories from small open source projects to large corporate behemoths. These experiences led to the development of many features seen in Yarn, the JavaScript package manager. Today, Maël is a Senior Software Engineer at Datadog, where he works on developer experience and continues to maintain Yarn.","twitter":"arcanis","linkedin":"","github":"arcanis","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>Monorepos, are they right for you?</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tMonorepos are back and more popular than ever. In this talk, we’ll dive into the problems\n\t\t\tthey solve, the challenges they create, and how they stack up to the alternatives. By the\n\t\t\tend of this presentation, you’ll have a better idea why so many communities find them\n\t\t\tappealing, and how to decide if monorepos are a good fit for your current and future\n\t\t\tprojects.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Lili Kastilio","company":"Snyk","title":"Technical Services Architect","image":{"url":"lili.jpeg"},"bio":"Technical Services Architect @ Snyk designing & building TypeScript solutions by working closely with our customers. Recently a Lead Engineer at Snyk working on extending our current languages offering by introducing new languages and language specific concepts into our system in the shape of libraries, parsers and microservices. Spending lots of time working on dependency resolution, understanding the inner workings of package managers and integrating with package registries. When not coding I like to spend my time hanging upside down doing circus things & mentoring others by working on open source side projects in Django + JavaScript.","twitter":"lilianakastilio","linkedin":"kastilioliliana","github":"lili2311","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>Why I love incremental delivery and why you should too.</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tIn order to innovate and deliver new products that your users will love you often have to\n\t\t\tdesign & build very complex features. You may even be the first doing that in that\n\t\t\tparticular way, so you will often struggle to find experts on the topic to help you. With\n\t\t\tincremental delivery you can empower your team to become the expert and still have a\n\t\t\tshorter time to market by delivering value to customers one mini feature at a time. At\n\t\t\tSnyk, my team has used incremental delivery to deliver countless technically complex\n\t\t\tfeatures – this is definitely one for your toolbox.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Nader Dabit","company":"Serverless @GraphQL","title":"Developer Advocate","image":{"url":"nader-dabit.jpg"},"bio":"Nader Dabit is an author and full stack developer currently working with Edge & Node on DeFi, Web3, and The Graph.","twitter":"dabit3","linkedin":"naderdabit","github":"dabit3","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>How to build a dApp</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tDecentralized apps (dApps) are continuing to gain momentum in the industry. Blockchain\n\t\t\tdevelopers are also now some of the highest paid in the entire industry. Building\n\t\t\tdecentralized apps is a paradigm shift that requires a different way of thinking than apps\n\t\t\tbuilt with traditional centralized infrastructure, tooling, and services.\n\t\t  </p>\n\t\t  <p>\n\t\t\tAs a React developer, I had a hard time understanding this entirely new (to me) ecosystem,\n\t\t\thow everything fit together, and the mental model needed to understand and be a productive\n\t\t\tfull stack developer in this space.\n\t\t  </p>\n\t\t  <p>\n\t\t\tIn this talk, I'll give a comprehensive overview of the space, how you can get started\n\t\t\tbuilding these types of applications, and the entire tech stack broken apart then put back\n\t\t\ttogether to show how everything works.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Anurag Goel","company":"Render","title":"Founder & CEO","image":{"url":"anurag-goel.jpeg"},"bio":"\n\t\t<p>\n\t\t  Anurag Goel is the founder and CEO of Render (\n\t\t  <a href=\"https://render.com\" target=\"_blank\">\n\t\t\thttps://render.com\n\t\t  </a>\n\t\t  ), a modern cloud built for developers. He was previously the 8th employee and the Head of\n\t\t  Risk at Stripe.\n\t\t</p>\n\t  ","twitter":"anuraggoel","linkedin":"anuragoel","github":"anurag","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>DevX in the Internet Age: One Step Forward, Two Steps Back</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tBuilding and hosting applications has both evolved and devolved since the dawn of the\n\t\t\tInternet. We'll run through the history of DX, from CGI hosting in the nineties to what we\n\t\t\tcan look forward to in the new decade.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Yihong Cheng","company":"Github1s","title":"Maintainer","image":{"url":"yihong-cheng.jpg"},"bio":"Yihong Chen is an engineer, works at Twitter, also an active open-source developer.","twitter":"xcv58","linkedin":"xcv58","github":"xcv58","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>The story of GitHub1s - speed & familiarity matters</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tAlmost everyone knows VS Code and probably has tried it. With GitHub1s, you can use VS\n\t\t\tCode as a web app to browse open source codes without cloning the repo. And even switch to\n\t\t\ta PR or a tag to see the changed files side by side. We will share how GitHub1s achieves\n\t\t\tthis and what open source community means to us.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Kyle Quest","company":"DockerSlim","title":"Creator of","image":{"url":"kyle-quest.png"},"bio":"Kyle has been building applications and platforms using many different cloud service providers and even more programming languages since the early days of cloud computing. He created DockerSlim to simplify the developer experience with containers and to empower developers to build and run containerized cloud-native applications. Kyle is passionate about open source, developer experience, distributed system, Big Data and security. He loves hackathons and taking things apart.","twitter":"kcqon","linkedin":"kylequest","github":"kcq","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>Simplifying the Journey of Your Containerized Application from Dev to Production</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tCreating a containerized application PoC is deceptively simple. Making it production ready is a lot of work though. This talk will cover what’s necessary to have a production ready containerized application and the steps to get there. We’ll explore the best practices and gotchas containerizing applications. We’ll also compare creating production ready containers the hard way and the easy way.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Aidan Cunniffe","company":"useoptic","title":"Creator of","image":{"url":"aidan-cunniffe.jpeg"},"bio":"Aidan Cunniffe keeps building developer tools and loves seeing everything the community builds with those tools. He’s the creator of the Optic OSS project that brings Git-like version control to the problem of documenting and managing changes to your APIs. Before that he built, contributed to, and advised many of the early tools in the low code space, and before that, he was building game engines during math class. When he’s not writing code, Aidan is one of the hosts of the API Storytelling stream, a runner, and a performing stand-up comic (jokes are builds, the audience is CI, laughs are green checks — you know why I do it).","twitter":"aidandcunniffe","linkedin":"acunniffe","github":"acunniffe","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>Make your APIs Developer-friendly</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tAPIs are not only ‘programming interfaces’ they’re how teams split work, collaborate with\n\t\t\tone another, share capabilities, and make awesome software. Most APIs are internal and\n\t\t\twe’re all in an API relationship with other teams of developers. So let’s talk about how\n\t\t\tgood API design, empathy, and modern tools can help you build better relationships with\n\t\t\tthe teams around you, great APIs, and amazing products. I’ll be sharing some stories from\n\t\t\tmy time in the API space, tools and practices to explore, and some slides from a few\n\t\t\tspecial guests. If you produce, consume or live with an API — you should definitely make\n\t\t\ttime for this talk!\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Natalie Pistunovich","company":"Aerospike","title":"Lead Developer Advocate","image":{"url":"natalie.png"},"bio":"Natalie is a learner, a Google Developer Expert for Go, an OpenAI Developer Ambassador, a public speaker and a sailor. When she's not working on robust systems at Aerospike, she is organizing the conferences: GopherCon Europe, Cloud Nein, HeyAI and BSides Berlin, and the Berlin chapters of the Go and Women Techmakers user groups. Previously, she was an Engineering Manager, Software and Hardware Engineer, and a Co-Founder of a mobile start-up. In her free time, she is wondering if there is life on Mars.","twitter":"NataliePis","linkedin":"nataliepistunovich","github":"Pisush","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>Building a K8s Operator for a Distributed Database</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tHow did we build a k8s operator that allows 100% up time for a high availability high\n\t\t\tworkload database? Operating a distributed high load, high throughput database in the\n\t\t\tcloud comes with several interesting challenges. In order to manage real-time serving of\n\t\t\tmission critical workloads at 100% availability we developed a Kubernetes operator that\n\t\t\thandles the operational complexities.\n\t\t  </p>\n\t\t  <p>We needed to handle the following requirements:</p>\n\t\t  <ul>\n\t\t\t<li>Apply live patches</li>\n\t\t\t<li>Replace live cluster with tens of nodes</li>\n\t\t\t<li>Handle degraded/crashed nodes</li>\n\t\t  </ul>\n\t\t  <p>Under these conditions:</p>\n\t\t  <ul>\n\t\t\t<li>High Availability</li>\n\t\t\t<li>remain 100% online with no down time</li>\n\t\t\t<li>Operate under very high workloads and traffic</li>\n\t\t\t<li>Manage replicated records across different hardware failure groups (rack awareness)</li>\n\t\t  </ul>\n\t\t  <p>Due to its stateful nature and the type of workloads that are usually handled, cluster management and recovery are non-trivial. We are using the Operators API to handle that complexity and control the clusters from within Kubernetes. In this talk we’ll cover the steps we took to plan and execute and the challenges we faced and share the best practices.</p>\n\t\t</div>\n\t  "},{"name":"Tuomas Artman","company":"Linear","title":"CTO","image":{"url":"tuomas-artman.jpeg"},"bio":"","twitter":"artman","linkedin":"tuomasartman","github":"artman","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>\n\t\t\t  How to prioritize dev experience in the development process above all else\n\t\t\t</strong>\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Ian Jennings","company":"HaxorDX","title":"Founder","image":{"url":"ian-jennings.jpeg"},"bio":"Ian Jennings is the founder of Haxor, a developer experience testing platform. Haxor tests and measures APIs, SDKs, and developer products with on-demand feedback from real developers.","twitter":"@ianj3nnings","linkedin":"jnnngs","github":"ianjennings","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>\n\t\t\t  Find friction in your developer experience by user testing with developers.\n\t\t\t</strong>\n\t\t  </p>\n  \n\t\t  <p>\n\t\t\tDo you know what's stopping developers from getting started with your product? Developer\n\t\t\texperience testing exposes the developer's point of view as they get started with your\n\t\t\tproduct. You don't need to be a UX researcher to start gathering feedback today. This talk\n\t\t\twill show you how you can run your own DX test in minutes with free tools.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Yevgeny Pats","company":"CloudQuery","title":"Founder","image":{"url":"yevgeny-pats.jpeg"},"bio":"","twitter":"yevgenypats","linkedin":"yevgeny-pats-5973328b","github":"yevgenypats","abstract":""},{"name":"Inian Parameshwaran","company":"Supabase","title":"Senior Software Engineer","image":{"url":"inian.jpeg"},"bio":"Inian Parameshwaran is a Senior Software Engineer at Supabase, an open-source Firebase alternative. He likes chocolates, working on developer tools and is passionate about security and performance. Previously, he founded a venture backed startup which helps speed up websites automatically. Did I mention he likes chocolates?","twitter":"everconfusedguy","linkedin":"inianp","github":"inian","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>Building Supabase Storage. DevX, performance, security - choose three</strong>\n\t\t  </p>\n  \n\t\t  <p>\n\t\t\tBalancing Developer Experience with other concerns like performance and security is not\n\t\t\tstraightforward. For example, you might be able to expose a simpler API at the cost of\n\t\t\tsystem performance. This talk goes into how we balance these concerns when we launched\n\t\t\tSupabase Storage.\n\t\t  </p>\n  \n\t\t  <p>\n\t\t\tSupabase Storage is an object storage service that tightly integrates with Postgres and\n\t\t\tleverages our existing Auth System elegantly. There are a lot of interesting design\n\t\t\tchoices we had to make along the way to build the storage middleware and the client APIs.\n\t\t\tWe explore why we built yet another object storage system and the pitfalls we avoided by\n\t\t\tevaluating prior work. The architecture we settled on also had the benefit of being\n\t\t\textensible to more storage backends in the future. We also put in a lot of thought in\n\t\t\tmaking the storage client APIs simple and familiar.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Stephen O'Grady","company":"RedMonk","title":"Co-Founder","image":{"url":"steve-o-grady.jpeg"},"bio":"","twitter":"sogrady","linkedin":"sogrady","github":"sogrady","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>The developer experience gap</strong>\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Thomas Paul Mann","company":"Raycast","title":"CEO & Co-Founder","image":{"url":"thomas-paul-mann.jpeg"},"bio":"Thomas loves to make tools. He's co-founder and CEO of Raycast and previously built products as a software engineer at Facebook.","twitter":"thomaspaulmann","linkedin":"thomas-paul-mann-5183101a4","github":"thomaspaulmann","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>\n\t\t\t  How to prioritize dev experience in the development process above all else\n\t\t\t</strong>\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Borja Burgos","company":"Datadog","title":"Director of Product","image":{"url":"bojra-burgos.jpeg"},"bio":"\n\t\t<p>\n\t\t  Borja Burgos is a DevEx-obsessed entrepreneur and technologist. In 2013 he co-founded Tutum\n\t\t  – a platform for developers to build and run their Docker applications. After Tutum's\n\t\t  acquisition by Docker in 2015, Borja relentlessly continued working on new tools and\n\t\t  services to delight developers, from their local desktops to their cloud environments.\n\t\t  Disappointed with the complexity, and lack of visibility, in modern-day testing and\n\t\t  continuous integration workflows he left Docker to co-founded Undefined Labs, makers of\n\t\t  <a href=\"https://scope.dev/\" target=\"_blank\">\n\t\t\tScope\n\t\t  </a>\n\t\t  and\n\t\t  <a href=\"https://ctr.run/\" target=\"_blank\">\n\t\t\tctr.run\n\t\t  </a>\n\t\t  . Now as part of Datadog, Borja and the rest of the\n\t\t  <a href=\"https://undefinedlabs.com/\" target=\"_blank\">\n\t\t\tUndefined Labs\n\t\t  </a>\n\t\t  team are building the next generation of developer-centric observability tools!\n\t\t</p>\n\t  ","twitter":"borja_burgos","linkedin":"borjaburgos","github":"borjaburgos","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>Using Observability to improve the Developer Experience</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tObservability is often associated with production and live environments, but it shouldn't\n\t\t\tbe! In this talk we'll explore innovative ways in which modern observability tools and\n\t\t\tbest practices can be leveraged during development to: improve developer productivity,\n\t\t\tidentify regressions earlier in the SDLC, and increase the performance and reliability of\n\t\t\tour CI/CD workflows.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Mike Nikles","company":"Gitpod","title":"Senior Developer Success Engineer","image":{"url":"mike-nikles.png"},"bio":"Mike Nikles is a software architect who values developer experience, productivity and team morale. For two decades, Mike has taken ideas from inception to production, at startups or as lead for teams at large companies. He works as a Senior Developer & Customer Success Engineer at Gitpod where he helps teams automate their ephemeral development environments.","twitter":"mikenikles","linkedin":"mikenikles","github":"mikenikles","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>Ephemeral Development Environments</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tLocal, long-lived development environments are what we are used to. We spend effort to\n\t\t\tconfigure and nurture them, which takes time away from more important tasks. In this talk,\n\t\t\tMike and Anton introduce the concept of ephemeral development environments, their benefits\n\t\t\tand how you can get started right away too.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Anton Kosyakov","company":"Gitpod","title":"Principal Software Engineer","image":{"url":"anton-kosyakov.jpeg"},"bio":"Anton has been working on Gitpod since its beginning. He is responsible for providing tight and up-to-date integration of VS Code with Gitpod workspaces.","twitter":"akosyakov","linkedin":"anton-kosyakov-4093b610","github":"akosyakov","abstract":"\n\t\t<div>\n\t\t  <p>\n\t\t\t<strong>Ephemeral Development Environments</strong>\n\t\t  </p>\n\t\t  <p>\n\t\t\tLocal, long-lived development environments are what we are used to. We spend effort to\n\t\t\tconfigure and nurture them, which takes time away from more important tasks. In this talk,\n\t\t\tMike and Anton introduce the concept of ephemeral development environments, their benefits\n\t\t\tand how you can get started right away too.\n\t\t  </p>\n\t\t</div>\n\t  "},{"name":"Ahmad Awais","company":"RapidAPI","title":"Head of Developer Relations ","image":{"url":"ahmad-awais.jpeg"},"bio":"<div>\n\t\t<p>\n\t\t  <a href=\"https://twitter.com/MrAhmadAwais/\" target=\"_blank\">Ahmad Awais</a> is an <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:6790272195416350720/\" target=\"_blank\">award-winning</a> open-source engineer​,​ Head of Developer Relations at <a href=\"https://rapidapi.com/company/about/\" target=\"_blank\">RapidAPI</a>, Google Developers Expert ​Dev Advocate, Node.js Community Committee Outreach Lead, WordPress Core​ Dev​, and ex VP ​of ​Engineering​​ at WGA. He has authored various open-source software tools used by millions of developers worldwide, like his <a href=\"https://ShadesOfPurple.pro/more\" target=\"_blank\">Shades of Purple</a> code-theme​ or projects like the​ <a href=\"https://github.com/AhmadAwais/corona-cli\" target=\"_blank\">corona-cli</a>​.\n\t\t</p>\n\t\t<p>\n\t\t  ​Awais ​loves to teach. Over 20,000 developers are learning from his courses ​, i.e., <a href=\"https://NodeCLI.com/?utm_medium=referral&amp;utm_campaign=speaking\" target=\"_blank\">NodeCLI.com</a>, <a href=\"https://VSCode.pro/?utm_medium=referral&amp;utm_campaign=speaking\" target=\"_blank\">VSCode.pro</a>,​ <a href=\"https://NextjsBeginner.com/?utm_medium=referral&amp;utm_campaign=speaking\" target=\"_blank\">NextjsBeginner.com</a>​​. He has spoken at 100+ tech conferences, including TEDx, ReactLive, Node Summit, Google Dev Summit, Next.js Conf. ​Awais received the FOSS community leadership recognition as one of the first 12 featured <a href=\"https://ahmadawais.com/github-stars/\" target=\"_blank\">GitHub Star</a> with a gold <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:6790272195416350720/\" target=\"_blank\">GitHub Stars Award</a>. ​He is a member of the SmashingMagazine Experts Panel; featured &amp; published author at CSS-Tricks, Tuts+, Scotch.io, SitePoint. You can mostly find ​him on Twitter <a href=\"https://twitter.com/MrAhmadAwais/\" target=\"_blank\">@MrAhmadAwais</a>, where he tweets his <a href=\"https://Awais.dev/odmt\" target=\"_blank\">#OneDevMinute</a> developer tips.\n\t\t​</p>\n\t  </div>","twitter":"MrAhmadAwais","linkedin":"mrahmadawais","github":"ahmadawais","abstract":"<div>\n\t\t<p>VSCode Power User Tips & Tricks</p>\n\t\t<p>\n\t\tAfter 10 years with Sublime Text, I switched to VSCode — the new open-source cross-platform editor everyone's talking about. I've spent over 1,000 hours perfecting my setup to help you switch today. In this talk, you'll get to learn tens of VSCode Power User workflows that'll help you save time and code more efficiently. Text manipulation to multi-cursors and even Markdown tips/tricks. You name it.\n\t\t</p>\n\t  </div>"}]